name: "sungrbd"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 227
    mean_value: 1
  }
  image_data_param {
    root_folder: "/scratch/xiaolonw/sunrgbd/data/"
    source: "/nfs/hn38/users/xiaolonw/sunrgbd/SUNRGBDtoolbox/testlist2.txt"
    batch_size: 100
    new_height: 227
    new_width: 227
    shuffle: false
  }
}



layer {
  name: "da_conv1" type: "Convolution" bottom: "data" top: "da_conv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 5 pad: 2 stride: 2
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } 
  }
}


layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "da_conv1"
  top: "bn1"
}


layer {
  name: "da_relu1" type: "ReLU" bottom: "bn1" top: "bn1" relu_param{ negative_slope: 0.2 }
}

layer {
  name: "da_conv2" type: "Convolution" bottom: "bn1" top: "da_conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 5 pad: 2 stride: 2 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}


layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "da_conv2"
  top: "bn2"
}


layer { 
  name: "da_relu2" type: "ReLU" bottom: "bn2" top: "bn2" relu_param { negative_slope: 0.2 }
}

layer {
  name: "da_conv3" type: "Convolution" bottom: "bn2" top: "da_conv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 kernel_size: 3 pad: 1 stride: 2 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } 
  }
}

layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "da_conv3"
  top: "bn3"
}

layer {
  name: "da_relu3" type: "ReLU" bottom: "bn3" top: "bn3"  relu_param { negative_slope: 0.2 }
}
layer {
  name: "da_conv4" type: "Convolution" bottom: "bn3" top: "da_conv4"
  param { lr_mult: 1 decay_mult: 1}
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 512 kernel_size: 3 pad: 1 stride: 2
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}


layer {
  name: "bn4"
  type: "BatchNorm"
  bottom: "da_conv4"
  top: "bn4"
}

layer {
  name: "da_relu4" type: "ReLU" bottom: "bn4" top: "bn4" relu_param{ negative_slope: 0.2 }
}
layer {
  name: "da_conv5" type: "Convolution" bottom: "bn4" top: "da_conv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 3 pad: 1 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}

layer {
  name: "bn5"
  type: "BatchNorm"
  bottom: "da_conv5"
  top: "bn5"
}


layer {
  name: "da_relu5" type: "ReLU" bottom: "bn5" top: "bn5" relu_param{ negative_slope: 0.2 }
}

layer {
  name: "da_roi_pool5"
  type: "ROIPooling"
  bottom: "bn5"
  bottom: "rois"
  top: "da_pool5"
  roi_pooling_param {
    pooled_w: 6
    pooled_h: 6
    spatial_scale: 0.0625 # 1/16
  }
}

layer {
  name: "da_fc6" type: "InnerProduct" bottom: "da_pool5" top: "da_fc6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "gaussian" std: 0.005 }
    bias_filler { type: "constant" value: 1 }
  }
}

layer {
  name: "bn6_2"
  type: "BatchNorm"
  bottom: "da_fc6"
  top: "bn6_2"
}


layer { name: "da_relu6" type: "ReLU" bottom: "bn6_2" top: "bn6_2" }

layer {
  name: "da_drop6" type: "Dropout" bottom: "bn6_2" top: "bn6_2"
  dropout_param { dropout_ratio: 0.5 }
}

layer {
  name: "da_fc7" type: "InnerProduct" bottom: "bn6_2" top: "da_fc7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "gaussian" std: 0.005 }
    bias_filler { type: "constant" value: 1 } 
  }
}

layer {
  name: "bn7"
  type: "BatchNorm"
  bottom: "da_fc7"
  top: "bn7"
}


layer { name: "da_relu7" type: "ReLU" bottom: "bn7" top: "bn7" }

layer {
  name: "da_drop7" type: "Dropout" bottom: "bn7" top: "bn7"
  dropout_param { dropout_ratio: 0.5 } 
}

layer {
  name: "da_cls_score"
  type: "InnerProduct"
  bottom: "bn7"
  top: "cls_score_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 19
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}



layer { name: "cls_prob" type: "Softmax" bottom: "cls_score_1" top: "cls_prob" }





